<?php

declare(strict_types=1);

return [
    // new order
    'subject-new-order' => 'Повідомляємо про підтвердження замовлення :number',
    'thanks' => 'Дякуємо за покупку в :name',
    'number' => 'Номер Вашого замовлення :number, а його деталі можете переглянути нижче.',
    'info' => 'Інформація про замовлення',
    'number-date' => 'Замовлення номер :number від :date',
    'delivery' => 'Доставка',
    'products' => 'Замовлені товари',
    'name' => 'Назва',
    'product_name' => 'Назва',
    'quantity' => 'Кількість',
    'price' => 'Ціна',
    'summary-products' => 'Вартість товарів',
    'summary-delivery' => 'Вартість доставки',
    'summary-discount' => 'Знижка',
    'summary-paid' => 'До оплати',
    'purchaser' => 'Покупець',
    'company' => 'Компанія',
    'name-surname' => 'Ім\'я і прізвище',
    'address' => 'Адреса',
    'zip' => 'Поштовий індекс',
    'city' => 'Населений пункт',
    'country' => 'Країна',
    'phone' => 'Контактний телефон',
    'regards' => 'З повагою',
    'team' => 'команда :team',
    'order-created' => 'Дякуємо за замовлення. Ви отримаєте окремий електронний лист, коли статус зміниться.',

    // status changed
    'subject-status-changed' => 'Статус замовлення :number змінився',
    'status-changed' => 'Статус Вашого замовлення змінився.',
    'status' => 'Поточний статус',

    // password reset
    'subject-password-reset' => 'Запит на зміну пароля',
    'hello' => 'Вітаємо',
    'reset-request' => 'Ми отримали запит на зміну пароля Вашого облікового запису.',
    'link' => 'Щоб змінити пароль, перейдіть за посиланням',
    'change-password' => 'змінити пароль',
    'warning' => 'Якщо це не Ви надіслали запит, проігноруйте цей електронний лист, і Ваш пароль доступу залишиться без змін.',

    // user registered
    'subject-user-registered' => 'Вітаємо на борту! Обліковий запис створено',
    'register-thanks' => 'Дякуємо за створення облікового запису на :name',
    'benefits' => 'Увійшовши в обліковий запис, Ви отримаєте доступ до особистої панелі клієнта, де Ви можете переглядати всі Ваші замовлення та інформацію про статус їх виконання. Через обліковий запис клієнта Ви також можете керувати контактними даними та адресами доставки.',

    // order paid
    'subject-order-paid' => 'Замовлення :number оплачено',
    'order-paid' => 'Ваше замовлення оплачено.',

    // send-urls
    'subject-send-urls' => 'Цифрові товари замовлення :code',
    'send-url-header' => 'Ваш список цифрових товарів із замовлення :code',
    'send-url-message' => 'Нижче наведено список придбаних товарів із замовлення <strong>:code</strong>, а також посилання для їх завантаження.',
    'send-url-ordered-products' => 'ЗАМОВЛЕНІ ТОВАРИ:',
    'send-url-download' => 'Завантажити',
    'send-url-regards' => 'З повагою,<br>Команда :team',

    // 2FA initialization
    'subject-tfa-initialization' => 'Підтвердження 2FA',
    'tfa-initialization-hello' => 'Шановний користувач!<br/>Ось Ваш одноразовий код безпеки:',
    'tfa-initialization-message' => 'Скористайтеся ним, щоб завершити процес налаштування двофакторної автентифікації.<br/><br/>Якщо це повідомлення адресоване не Вам, проігноруйте його.',

    // 2FA recovery codes
    'subject-recovery-codes' => 'Коди відновлення 2FA',
    'recovery-codes-hello' => 'Шановний користувач!<br />Ваші коди 2FA змінено!',
    'recovery-codes-message' => 'Якщо це не Ви намагалися увійти у систему, це означає, що хтось зламав Ваш пароль і намагається отримати доступ до Вашого облікового запису.<br/>Будь ласка, змініть свій пароль якомога швидше!',

    // 2FA security code
    'subject-security-code' => 'Код безпеки 2FA',
    'security-code-hello' => 'Шановний користувач!<br />Ось Ваш одноразовий код безпеки:',
    'security-code-message' => 'Скористайтеся ним для автентифікації операції.<br/><br/>Якщо це не Ви намагалися увійти у систему, це означає, що хтось зламав Ваш пароль і намагається отримати доступ до Вашого облікового запису.<br/>Будь ласка, змініть свій пароль якомога швидше!',
];
